<template>
  
  <blockquote class="blockquote">
    <div style="width:1014px;margin:auto">
      <v-card
        class=" ma-2 pa-6 mt-10 pb-0 pt-0"
        elevation="3"
        outlined
      >
    
        <h1 class="display-1">
          征途2猎豹辅助   <i class="fab fa-vimeo-v"></i><em class="subtitle-1">5.35</em>
        </h1>

        <div class="my-2">
          <a href="http://jikeyt.com/download/征途2猎豹辅助.rar">
            <v-btn
              class="ma-2"
              :loading="loading"
              :disabled="loading"
              dark
              color="#8BC34A"
            >
              点击下载
              <v-icon class="ml-2">mdi-cloud-download</v-icon>
            </v-btn>
          </a>
          <strong class="body-2">
            下载即可免费试用 (开卡送征途2专用虚拟机)
          </strong>
        </div>
        <div class="pa-0 mt-3">
        <a class="mr-12" href="http://jikeyt.com/download/征途2辅助使用说明.rar"
          >使用教程<em>(点击下载)</em> <v-icon>mdi-file-download</v-icon>
        </a>
        <a href="https://pan.baidu.com/s/1qWDMRYO#list/path=%2F" target="_blank"
          >用户常见问题解决视频 <v-icon>mdi-account-question</v-icon>
        </a>
        <a class="ml-12" href="#problem"
          >常见问题解答 <v-icon>mdi-help-rhombus</v-icon></a
        >
        </div>
            <div class="my-2 kefu">
            <p>
       <span >客服QQ：86617514 </span> (添加备注：征途2辅助) <br>
            <v-img
            :src="require('../assets/wx.png')"
            class="my-3"
            contain
            height="120"
            width="120"
          />工作时间：周一至周六 上午8:0-12:00
        下午13:00-17:00 晚上及周日:不定时在线
      </p>
         </div>
      </v-card>

      <br />

      <h2>更新日志:</h2>
      <p>
        2020年6月4日更新v5.35
        解决征途2经典版游戏更新导致不能从桃花源到王城的问题
      </p>
      <h2><i class="fas baby-carriage"></i>注意事项:</h2>
      <p>
        1.特别重要！
        单开的时候如果游戏已经打开，要把鼠标放在游戏画面再按F10启动或者点击启动按钮后马上点击游戏窗口。保证游戏窗口是激活，标题栏不能是灰色的。多开可以任意启动
      </p>
      <p><br /></p>
      <p>
        2.如果你的电脑分辨率是1366*768（大部分笔记本是这个分辨率）,或电脑分辨率的高度不能大于900的需要把开始任务栏改到桌面右边竖起来，并且把电脑外观改成WINDOWS经典样式。（修改方法：右键点任务栏取消锁定就可以直接托到桌面右侧。WIN7系统右键点桌面，选择个性设置，选择窗口拉到最底下有windows经典样式的选择，XP系统右键单击桌面选择属性，外观页里面可以设置成WINDOWS经典样式）
      </p>
      <br />
      <p>
        3.压缩包里面有一个“无需注册”结尾命名，
        意思是用这个启动辅助不用申请账号，直接填充值卡激活软件即可，适合量大客户使用。
      </p>
      <br />
      <p>
        4.很重要!
        如果使用中出现例如人物不动,不过边或其它不正常,请先检查游戏分辨率是否为1024*768窗口模式，刷新率快，32位色
      </p>
      <br />
 
      <br />
      <P
        >5.请把电脑分辨率设置成与显示器匹配的分辨率（笔记本电脑为1366*768分辨率的请把开始任务栏改到桌面右侧，并把外观改成WINDOWS经典样式)，电脑推荐：
        1440*900,1600*900,1280*1024,1920*1080低了会出故障</P
      ><br />
      <p>
        6.游戏分辨率 1024*768.,色彩32位.窗口模式
        刷新速度:快,必须使用完整版客户端，不能使用微端
      </p>
      <br /><br />

      <h2 id="problem"><i class="iconfont" >&#xe669;</i>常见问题解答</h2>
      <p>
        单开特别提醒！很重要！<br />
        单开的时候如果游戏已经打开，要把鼠标放在游戏窗口再按F10启动或者点击启动按钮后马上点击游戏窗口。保证游戏窗口是激活，标题栏不能是灰色的。多开可以任意启动<br /><br />
        很重要!
        如果您使用中是出现问题,例如人物不动,不过边或其它不正常,请先把电脑外观改成WINDOWS经典样式,然后关掉游戏,再重新启动辅助(不懂怎么改可以百度搜索"改成windows经典样")<br /><br /><br />
        问:我打开辅助设置界面都是空白的?
      </p>
      <br />
      答:有4个方法解决.第一个最简单的方法,关掉辅助重新再开就会显示了.第二,辅助不要安装在桌面,或者辅助软件所有的文件都要放在一个文件夹下面.第三,也有可能是你杀毒或安全软件阻止了,请关掉杀毒再开辅助,第四.把辅助软件目录下面的所有OCX的文件都复制到C盘WINDOWS目录下面<br /><br /><br />
      问：为什么我游戏每次换地图之后游戏分辨率就变到最大呢？<br />
      答：你手动到游戏里面把游戏改成 1024*768 窗口模式
      ，然后关掉游戏重新开，以后就不会再变了<br /><br /><br />
      问:有时候跳过地图突然会游戏全屏显示，我都在游戏里设置好了1024*768分辨率了的<br />
      答:你手动进入游戏把分辨率调到其他
      分辨率,然后再改回1024*768,再退出游戏,以后就不会有这种情况发生了.<br /><br /><br />

      问:外挂设置1-45，都到50了怎么还在做主线啊<br />
      答:主线1-45,是指主线1-45级任务,这是任务等级,不等于角色等级,如果你要角色到45级换号请在辅助的主线设置里面设置角色多少等级换号.<br /><br /><br />
      问:猎豹辅助支持虚拟机吗?<br />
      答:支持虚拟机,购买月卡，我们可以送虚拟机。<br /><br /><br />
      问：辅助登陆游戏时老是提示账号或密码错误<br />
      答：首先你要检查你输入的游戏用户名和密码是否正确，输入法状态要系统默认的英文状态，有些电脑你手动改成英文默认输入法后，在登陆游戏的时候它自动又变成了其它输入法的中文状态，导致账号密码输入错误，
      你需要把输入法设置成默认打开是英文输入状态，具体怎么设置在教程里面有一张输入法设置图片，请按照面标注的设置好<br /><br /><br />
      问：没反应 我启动了 启动成功读取信息中 辅助半天没反应 ？<br />
      答：杀毒或安全软件提示的时候要全部允许，你现在把杀毒和安全软件全部关闭，然后把辅助复制到一个新文件夹里面，再打开试试，如果还不行就要重新启动电脑再试试。如果以上方法还不行,你只能把所有杀毒和安全软件都卸载了,再重新启动电脑,重新安装辅助.<br /><br /><br />
      问:我的经典版添加了淮阳秘宝，脚本不接任务？<br />
      答:经典版的国外挖宝，请在任务里面添加
      国外挖宝，不要添加淮阳秘宝，添加一个国外挖宝
      就是做一次挖宝，添加两次就是做两次挖宝
      。（其他任务次数是可以设置的，默认都是全部做完）<br /><br /><br />
      问：你们的辅助最多可以几开？<br />
      答：最多5开，可以同时开5个游戏窗口做任务，任务做完了可以自动换号<br /><br /><br />
      问：你们的辅助支持征途2经典版吗？<br />
      答：支持征途2经典版，征途2S和征途2经典版都支持，已经做了兼容处理了，脚本会自动识别，无需设置。<br /><br /><br />
      问：我点开始（或按F10）了怎么没动静啊<br />
      答：1.你需要先点击试用或登录脚本，在脚本说明页有试用和登录入口。2.杀毒软件或360提示阻止的时候要选择全部允许，你可以关掉杀毒软件再试试。<br /><br /><br />
      问:脚本自动登录服务器老是登陆新区，不登陆我设置的服务器？<br />
      答:服务器名称填写必须和游戏上面显示的一模一样，例如服务器”王者宏图“就要填“王者宏图(双线)-电信入口
      ”，中间的杠号"-"要在英文状态下面输入<br /><br /><br />
      问:猎豹辅助是否绑机器码(绑定电脑)吗？<br />
      答:不绑定,可以换电脑使用辅助，适合上班一族，上班在公司用，回家可在家里用<br /><br />
      问：我挂机的时候能用电脑做其它事情吗？<br />
      答：前台模式不能对电脑进行操作，游戏画面不能被遮挡，否则脚本不能正常运行。后台模式运行可以做其它事情。<br /><br /><br />
      问：自动换号 的前提是什么 ？<br />
      答：当前账号把任务列表的任务全部做完了脚本会自动换下一个号。是从上到下的顺序换号。<br /><br /><br />
      问：主线任务 只能到45 级吗，有支线吗?<br />
      答：目前能到140级，脚本会自动做45级内的部分支线任务和自动吃英雄帖，等级不到45级时会自动桃园运镖，自动桃园种植，更多主线任务我们以后还会制作，请关注。<br /><br /><br />
      问:我能不能多试用一会，刚刚设置耽误了点时间 ?<br /><br /><br />
      答：试用的时候请先设置好脚本后再点试用按钮，每天能试用6次总共90分钟，是从点击试用按钮开始计算时间的。<br /><br /><br />
      问：脚本不会动，是不是哪里设置错了？<br />
      答：请把游戏分辨率改成 1024*768,色彩32位,窗口模式
      刷新速度:快。（如果你是试用要先点软件上面的登录-试用按钮，激活软件，试用不需要注册帐号）<br /><br /><br />
      问：帐号必须要设置吗?<br />
      答：游戏没有手动打开的情况下必须设置好游戏账号脚本才能启动成功（软件的自动换号页设置）。<br /><br /><br />
      问：我打开游戏了 怎么运行 脚本 ？<br />
      答：单开：鼠标放在游戏窗口，按启动键。多开：直接按启动键就可以了<br /><br /><br />
      问：有挖宝和张天师功能吗？<br />
      答：2013年9月18日更新V5.6版本增加了挖宝功能，张天师暂时还没有，我们会继续制作的，请关注。<br /><br /><br />
      问： 我挂在那里就可以不管了，直接等他到45及 就可以了 吗？<br />
      答：是的。主线任务等级不到45级脚本会自动做部分支线、桃园运镖、和桃园种植，有时候这些全部做完还差一点经验到45级，你最好在主线任务后面添加一个喝酒任务（喝酒地点设在桃花源）。<br /><br /><br />
      问：主线任务新区 可以用吗？<br />
      答：可以的，主线目前支持1-150级（1-45级会自动做部分支线任务,45-70会自己做激活元神任务），任意等级都可以启动脚本。<br /><br /><br />
      问：WIN10 的系统不行？<br />
      答：win10 系统可以用 ，只能前台模式，但是可以装虚拟机实现后台。<br /><br /><br />
      问：我的辅助软件界面 没有登陆和试用按钮,征途2客户端路径设置也没有？<br />
      答：您是WIN7系统吧，请到电脑系统的控制面板把显示比例设置成“显示100%”<br /><br /><br />
      问：淘宝客服不在线我可以买充值卡吗？<br />
      答：先联系客服后再买，如果淘宝客服不在线，可以直接加QQ 86617514
      或者微信ID:A6171L 购买<br /><br /><br />
      问：我可以试用一下吗？<br />
      答：可以，每天能试用6次,每次15分钟。下载后就可以免费试用，点击软件右上方的"登陆"，然后直接点"试用"
      （试用无需注册帐号，直接点击试用按钮）<br /><br /><br />
      问：脚本运行需要先开游戏吗？<br />
      答：这个没有关系，都可以的。你可以自己手动先打开游戏，也可以让脚本自动打开游戏,脚本自动开游戏需要添加游戏账号和路径.如果你的游戏已经打开,如果要单开,请把鼠标放在游戏窗口按F10启动脚本.<br /><br /><br />
      问：我添加了主线任务，脚本启动后直接搜索任务然后就说 主线任务结束呢 ？<br />
      答：请把游戏分辨率改成 1024*768,色彩32位,窗口模式
      刷新速度:快。游戏画面右侧的任务追踪要把主线任务显示出来。<br /><br /><br />
      问：我把电脑分辨率改成和游戏一样的分辨率可以吗？<br />
      答：不能使用。电脑分辨率两个方向都要大于1024*768，推荐电脑分辨率：
      1440*900,1600*900,1280*1024,1920*1080<br /><br /><br />
      问：我的屏幕分辨率是1366*768，能用吗？<br />
      答：电脑桌面分辨率必须大于1024X768（分辨率高度不能大于800的可以把任务栏修改到桌面右侧，就可以使用）<br /><br /><br />
      问：笔记本能用这个辅助吗？<br />
      答：辅助的使用和是不是笔记本没有关系，主要是你的电脑系统需要是XP 或WIN7
      32位系统，电脑分辨率两 个方向都要大于1024*768<br /><br /><br />
      问： 关闭游戏后电脑蓝屏。<br />
      答：脚本有保护器 ，会和游戏冲突，正确做法是，停止脚本运行时多按几次F12
      让确定脚本完全停止后，再等一会，再关脚 本，再关游戏。<br /><br /><br />

      <h2>新增：自定义点击功能(可自主解决游戏突发问题)</h2>
      <br />

      功能作用：<br />
      1.解决游戏更新后某些新弹窗脚本还没来得及更新，不能关闭的问题<br />
      2.自己需要不定时点击游戏画面某一个位置<br />
      ===========<br />
      开启方法：<br />
      第一步：首先在游戏画面截取需要点击的位置保存为bmp位图文件。<br />
      ====================<br />
      (必须是bmp建议用Prtsc 键截图，然后画图软件里面裁剪出需要点击的位置)。<br />
      =======<br />
      文件名必须是“点击自定义1.bmp”,如果有更多文件就保存为<br />
      “点击自定义2.bmp”，依次类推，文件名加1即可，默认是支持3个文件。<br />
      ===========<br />
      第二步：把保存的“点击自定义1.bmp”文件复制到<br />
      C:\rwxzt\plugin\zt 目录下面入，这样就可以了。<br />
      ========<br />
      第三步：如果添加的文件超过3个，请到脚本设置页<br />
      “主线|挖宝|邮寄|军票”->“挖宝，邮寄等验证设置”->左下角的<br />
      报警：3秒设置 ，3改成你需要自定义点击的数量。如果改成10就是可以添加<br />
      1-10个"点击自定义1.bmp""点击自定义2.bmp""点击自定义3.bmp"一直到"点击自定义10.bmp"<br />
      的10个自定义点击位置的图片。<br />

      <a href="#">回到顶部</a>
    </div>
  </blockquote>
</template>

<style src="../assets/icons/fa/css/all.css"></style>
<style src="../assets/icons/ali/iconfont.css"></style>

<style scoped >
div > a:hover{
  color:red;

}
.kefu {
  font-size: 16px;
}

.kefu span{

 color:green;
}

div > a:active{
  color:yellow;

}

i{
  font-size: 16px;
  margin-right: 2px;
}

i.iconfont{
  font-size: 24px;
  margin-right: 4px;
}
</style>
